results/baseline/case-2-descartado-pre-correcao/moderado/recommendations/descartado-run-01-conflito-de-porta/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/load/recommendations-ramp-strong.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m25s max duration (incl. graceful stop):
              * ramp_load: Up to 50 looping VUs for 1m20s over 3 stages (gracefulRampDown: 5s, gracefulStop: 30s)


running (0m01.0s), 07/50 VUs, 28 complete and 0 interrupted iterations
ramp_load   [   1% ] 07/50 VUs  0m01.0s/1m20.0s

running (0m02.0s), 09/50 VUs, 76 complete and 0 interrupted iterations
ramp_load   [   2% ] 09/50 VUs  0m02.0s/1m20.0s

running (0m03.0s), 11/50 VUs, 142 complete and 0 interrupted iterations
ramp_load   [   4% ] 11/50 VUs  0m03.0s/1m20.0s

running (0m04.0s), 13/50 VUs, 216 complete and 0 interrupted iterations
ramp_load   [   5% ] 13/50 VUs  0m04.0s/1m20.0s

running (0m05.0s), 16/50 VUs, 306 complete and 0 interrupted iterations
ramp_load   [   6% ] 16/50 VUs  0m05.0s/1m20.0s

running (0m06.0s), 18/50 VUs, 417 complete and 0 interrupted iterations
ramp_load   [   7% ] 18/50 VUs  0m06.0s/1m20.0s

running (0m07.0s), 20/50 VUs, 535 complete and 0 interrupted iterations
ramp_load   [   9% ] 20/50 VUs  0m07.0s/1m20.0s

running (0m08.0s), 22/50 VUs, 665 complete and 0 interrupted iterations
ramp_load   [  10% ] 22/50 VUs  0m08.0s/1m20.0s

running (0m09.0s), 25/50 VUs, 810 complete and 0 interrupted iterations
ramp_load   [  11% ] 25/50 VUs  0m09.0s/1m20.0s

running (0m10.0s), 27/50 VUs, 973 complete and 0 interrupted iterations
ramp_load   [  12% ] 27/50 VUs  0m10.0s/1m20.0s

running (0m11.0s), 29/50 VUs, 1146 complete and 0 interrupted iterations
ramp_load   [  14% ] 29/50 VUs  0m11.0s/1m20.0s

running (0m12.0s), 31/50 VUs, 1334 complete and 0 interrupted iterations
ramp_load   [  15% ] 31/50 VUs  0m12.0s/1m20.0s

running (0m13.0s), 34/50 VUs, 1533 complete and 0 interrupted iterations
ramp_load   [  16% ] 34/50 VUs  0m13.0s/1m20.0s

running (0m14.0s), 36/50 VUs, 1754 complete and 0 interrupted iterations
ramp_load   [  17% ] 36/50 VUs  0m14.0s/1m20.0s

running (0m15.0s), 38/50 VUs, 1972 complete and 0 interrupted iterations
ramp_load   [  19% ] 38/50 VUs  0m15.0s/1m20.0s

running (0m16.0s), 40/50 VUs, 2209 complete and 0 interrupted iterations
ramp_load   [  20% ] 40/50 VUs  0m16.0s/1m20.0s

running (0m17.0s), 43/50 VUs, 2441 complete and 0 interrupted iterations
ramp_load   [  21% ] 43/50 VUs  0m17.0s/1m20.0s

running (0m18.0s), 45/50 VUs, 2682 complete and 0 interrupted iterations
ramp_load   [  22% ] 45/50 VUs  0m18.0s/1m20.0s

running (0m19.0s), 47/50 VUs, 2923 complete and 0 interrupted iterations
ramp_load   [  24% ] 47/50 VUs  0m19.0s/1m20.0s

running (0m20.0s), 49/50 VUs, 3145 complete and 0 interrupted iterations
ramp_load   [  25% ] 49/50 VUs  0m20.0s/1m20.0s

running (0m21.0s), 50/50 VUs, 3366 complete and 0 interrupted iterations
ramp_load   [  26% ] 50/50 VUs  0m21.0s/1m20.0s

running (0m22.0s), 50/50 VUs, 3610 complete and 0 interrupted iterations
ramp_load   [  27% ] 50/50 VUs  0m22.0s/1m20.0s

running (0m23.0s), 50/50 VUs, 3808 complete and 0 interrupted iterations
ramp_load   [  29% ] 50/50 VUs  0m23.0s/1m20.0s

running (0m24.0s), 50/50 VUs, 4035 complete and 0 interrupted iterations
ramp_load   [  30% ] 50/50 VUs  0m24.0s/1m20.0s

running (0m25.0s), 50/50 VUs, 4244 complete and 0 interrupted iterations
ramp_load   [  31% ] 50/50 VUs  0m25.0s/1m20.0s

running (0m26.0s), 50/50 VUs, 4408 complete and 0 interrupted iterations
ramp_load   [  32% ] 50/50 VUs  0m26.0s/1m20.0s

running (0m27.0s), 50/50 VUs, 4488 complete and 0 interrupted iterations
ramp_load   [  34% ] 50/50 VUs  0m27.0s/1m20.0s

running (0m28.0s), 50/50 VUs, 4680 complete and 0 interrupted iterations
ramp_load   [  35% ] 50/50 VUs  0m28.0s/1m20.0s

running (0m29.0s), 50/50 VUs, 4891 complete and 0 interrupted iterations
ramp_load   [  36% ] 50/50 VUs  0m29.0s/1m20.0s

running (0m30.0s), 50/50 VUs, 5082 complete and 0 interrupted iterations
ramp_load   [  37% ] 50/50 VUs  0m30.0s/1m20.0s

running (0m31.0s), 50/50 VUs, 5268 complete and 0 interrupted iterations
ramp_load   [  39% ] 50/50 VUs  0m31.0s/1m20.0s

running (0m32.0s), 50/50 VUs, 5449 complete and 0 interrupted iterations
ramp_load   [  40% ] 50/50 VUs  0m32.0s/1m20.0s

running (0m33.0s), 50/50 VUs, 5647 complete and 0 interrupted iterations
ramp_load   [  41% ] 50/50 VUs  0m33.0s/1m20.0s

running (0m34.0s), 50/50 VUs, 5831 complete and 0 interrupted iterations
ramp_load   [  42% ] 50/50 VUs  0m34.0s/1m20.0s

running (0m35.0s), 50/50 VUs, 6047 complete and 0 interrupted iterations
ramp_load   [  44% ] 50/50 VUs  0m35.0s/1m20.0s

running (0m36.0s), 50/50 VUs, 6251 complete and 0 interrupted iterations
ramp_load   [  45% ] 50/50 VUs  0m36.0s/1m20.0s

running (0m37.0s), 50/50 VUs, 6445 complete and 0 interrupted iterations
ramp_load   [  46% ] 50/50 VUs  0m37.0s/1m20.0s

running (0m38.0s), 50/50 VUs, 6632 complete and 0 interrupted iterations
ramp_load   [  47% ] 50/50 VUs  0m38.0s/1m20.0s

running (0m39.0s), 50/50 VUs, 6816 complete and 0 interrupted iterations
ramp_load   [  49% ] 50/50 VUs  0m39.0s/1m20.0s

running (0m40.0s), 50/50 VUs, 6995 complete and 0 interrupted iterations
ramp_load   [  50% ] 50/50 VUs  0m40.0s/1m20.0s

running (0m41.0s), 50/50 VUs, 7174 complete and 0 interrupted iterations
ramp_load   [  51% ] 50/50 VUs  0m41.0s/1m20.0s

running (0m42.0s), 50/50 VUs, 7370 complete and 0 interrupted iterations
ramp_load   [  52% ] 50/50 VUs  0m42.0s/1m20.0s

running (0m43.0s), 50/50 VUs, 7599 complete and 0 interrupted iterations
ramp_load   [  54% ] 50/50 VUs  0m43.0s/1m20.0s

running (0m44.0s), 50/50 VUs, 7812 complete and 0 interrupted iterations
ramp_load   [  55% ] 50/50 VUs  0m44.0s/1m20.0s

running (0m45.0s), 50/50 VUs, 8029 complete and 0 interrupted iterations
ramp_load   [  56% ] 50/50 VUs  0m45.0s/1m20.0s

running (0m46.0s), 50/50 VUs, 8221 complete and 0 interrupted iterations
ramp_load   [  57% ] 50/50 VUs  0m46.0s/1m20.0s

running (0m47.0s), 50/50 VUs, 8400 complete and 0 interrupted iterations
ramp_load   [  59% ] 50/50 VUs  0m47.0s/1m20.0s

running (0m48.0s), 50/50 VUs, 8590 complete and 0 interrupted iterations
ramp_load   [  60% ] 50/50 VUs  0m48.0s/1m20.0s

running (0m49.0s), 50/50 VUs, 8791 complete and 0 interrupted iterations
ramp_load   [  61% ] 50/50 VUs  0m49.0s/1m20.0s

running (0m50.0s), 50/50 VUs, 8993 complete and 0 interrupted iterations
ramp_load   [  62% ] 50/50 VUs  0m50.0s/1m20.0s

running (0m51.0s), 50/50 VUs, 9207 complete and 0 interrupted iterations
ramp_load   [  64% ] 50/50 VUs  0m51.0s/1m20.0s

running (0m52.0s), 50/50 VUs, 9397 complete and 0 interrupted iterations
ramp_load   [  65% ] 50/50 VUs  0m52.0s/1m20.0s

running (0m53.0s), 50/50 VUs, 9574 complete and 0 interrupted iterations
ramp_load   [  66% ] 50/50 VUs  0m53.0s/1m20.0s

running (0m54.0s), 50/50 VUs, 9733 complete and 0 interrupted iterations
ramp_load   [  67% ] 50/50 VUs  0m54.0s/1m20.0s

running (0m55.0s), 50/50 VUs, 9897 complete and 0 interrupted iterations
ramp_load   [  69% ] 50/50 VUs  0m55.0s/1m20.0s

running (0m56.0s), 50/50 VUs, 10070 complete and 0 interrupted iterations
ramp_load   [  70% ] 50/50 VUs  0m56.0s/1m20.0s

running (0m57.0s), 50/50 VUs, 10275 complete and 0 interrupted iterations
ramp_load   [  71% ] 50/50 VUs  0m57.0s/1m20.0s

running (0m58.0s), 50/50 VUs, 10491 complete and 0 interrupted iterations
ramp_load   [  72% ] 50/50 VUs  0m58.0s/1m20.0s

running (0m59.0s), 50/50 VUs, 10686 complete and 0 interrupted iterations
ramp_load   [  74% ] 50/50 VUs  0m59.0s/1m20.0s

running (1m00.0s), 50/50 VUs, 10855 complete and 0 interrupted iterations
ramp_load   [  75% ] 50/50 VUs  1m00.0s/1m20.0s

running (1m01.0s), 50/50 VUs, 11030 complete and 0 interrupted iterations
ramp_load   [  76% ] 50/50 VUs  1m01.0s/1m20.0s

running (1m02.0s), 50/50 VUs, 11185 complete and 0 interrupted iterations
ramp_load   [  77% ] 50/50 VUs  1m02.0s/1m20.0s

running (1m03.0s), 50/50 VUs, 11352 complete and 0 interrupted iterations
ramp_load   [  79% ] 50/50 VUs  1m03.0s/1m20.0s

running (1m04.0s), 50/50 VUs, 11546 complete and 0 interrupted iterations
ramp_load   [  80% ] 50/50 VUs  1m04.0s/1m20.0s

running (1m05.0s), 50/50 VUs, 11705 complete and 0 interrupted iterations
ramp_load   [  81% ] 50/50 VUs  1m05.0s/1m20.0s

running (1m06.0s), 48/50 VUs, 11880 complete and 0 interrupted iterations
ramp_load   [  82% ] 48/50 VUs  1m06.0s/1m20.0s

running (1m07.0s), 44/50 VUs, 12054 complete and 0 interrupted iterations
ramp_load   [  84% ] 44/50 VUs  1m07.0s/1m20.0s

running (1m08.0s), 41/50 VUs, 12222 complete and 0 interrupted iterations
ramp_load   [  85% ] 41/50 VUs  1m08.0s/1m20.0s

running (1m09.0s), 37/50 VUs, 12399 complete and 0 interrupted iterations
ramp_load   [  86% ] 37/50 VUs  1m09.0s/1m20.0s

running (1m10.1s), 35/50 VUs, 12577 complete and 0 interrupted iterations
ramp_load   [  87% ] 35/50 VUs  1m10.0s/1m20.0s

running (1m11.1s), 31/50 VUs, 12612 complete and 0 interrupted iterations
ramp_load   [  89% ] 31/50 VUs  1m11.0s/1m20.0s

running (1m12.1s), 27/50 VUs, 12728 complete and 0 interrupted iterations
ramp_load   [  90% ] 27/50 VUs  1m12.0s/1m20.0s

running (1m13.1s), 24/50 VUs, 12844 complete and 0 interrupted iterations
ramp_load   [  91% ] 24/50 VUs  1m13.0s/1m20.0s

running (1m14.1s), 21/50 VUs, 12970 complete and 0 interrupted iterations
ramp_load   [  92% ] 21/50 VUs  1m14.0s/1m20.0s

running (1m15.1s), 18/50 VUs, 13080 complete and 0 interrupted iterations
ramp_load   [  94% ] 18/50 VUs  1m15.0s/1m20.0s

running (1m16.1s), 14/50 VUs, 13180 complete and 0 interrupted iterations
ramp_load   [  95% ] 14/50 VUs  1m16.0s/1m20.0s

running (1m17.1s), 11/50 VUs, 13260 complete and 0 interrupted iterations
ramp_load   [  96% ] 11/50 VUs  1m17.0s/1m20.0s

running (1m18.1s), 07/50 VUs, 13318 complete and 0 interrupted iterations
ramp_load   [  97% ] 07/50 VUs  1m18.0s/1m20.0s

running (1m19.1s), 04/50 VUs, 13358 complete and 0 interrupted iterations
ramp_load   [  99% ] 04/50 VUs  1m19.0s/1m20.0s

running (1m20.1s), 01/50 VUs, 13373 complete and 0 interrupted iterations
ramp_load   [ 100% ] 01/50 VUs  1m20.0s/1m20.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1500' p(95)=167.58ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 40122   500.524683/s
    checks_succeeded...: 100.00% 40122 out of 40122
    checks_failed......: 0.00%   0 out of 40122

    ✓ status 200
    ✓ response has userId
    ✓ response has recommendations

    HTTP
    http_req_duration..............: avg=78.52ms  min=2.09ms   med=75.52ms  max=1.52s p(90)=141.63ms p(95)=167.58ms
      { expected_response:true }...: avg=78.52ms  min=2.09ms   med=75.52ms  max=1.52s p(90)=141.63ms p(95)=167.58ms
    http_req_failed................: 0.00%  0 out of 13374
    http_reqs......................: 13374  166.841561/s

    EXECUTION
    iteration_duration.............: avg=237.48ms min=154.36ms med=234.02ms max=1.7s  p(90)=302.52ms p(95)=329.86ms
    iterations.....................: 13374  166.841561/s
    vus............................: 1      min=1          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 355 MB 4.4 MB/s
    data_sent......................: 1.2 MB 15 kB/s



running (1m20.2s), 00/50 VUs, 13374 complete and 0 interrupted iterations
ramp_load ✓ [ 100% ] 00/50 VUs  1m20s